/*
* ------------ СПИСОК ТОГО, ЧТО НЕ СДЕЛАЛ ------------

& A -> Структуры данных -> DSU.cpp
& A -> Строки -> Преффикс-функция.cpp
& A -> Длинна арифметика -> Длинная арифметика.cpp

? acmp -> Сортировка -> Армия.cpp
? acmp -> Степень перестановки.cpp
? acmp -> Меньшиков -> Разложение на слагаемые.cpp
? acmp -> ДП -> Сумма степеней двойки.cpp

^ contester -> Лесенки
^ contester -> Столовские котлеты
^ contester -> За решеткой
^ contester -> Запаковка
^ contester -> Строки

! contester -> разделы -> неотсортированные -> Brackets

*/