/*
* ------------ АПЕЛЬСИНЫ ------------
& нод и нок
~ gcd ~ lcm
? Задача на знание понятий НОД и НОК.
? Суть в том, что ответом на задачу будет число, равное НОК чтсел n и m, деленному на m, где n - кол-во гостей, а m - число апельсионов.

? Вопрос: почему так? НОК двух чисел - это наименьшее целое число, на которое делятся оба числа. 
? А значит, lcm(n, m) будет равно числу, которое делится и на кол-во гостей, и на кол-во апельсинов. Причем это число будет наименьшим, 
? которое только может быть. Получается, если разделить это число на количество апельсинов, то получится именно то, чтсло долек, на которое
? нужно разрезать каждый апельсин.
todo: Почему? Я пока не понял...
*/

#include <iostream>

using namespace std;

using T = long long;

T gcd(T a, T b) {
    if (!b)
        return a;

    return gcd(b, a % b);
}

T lcm(T a, T b) {
    return a / gcd(a, b) * b;
}

int main() {
    // ...
    T n, m;
    cin >> n >> m;

    cout << lcm(n, m) / m;

    return 0;
}
