/*
* ------------ ПРОВЕРКА ГРАФА НА СВЯЗНОСТЬ ------------
^ O(n + m)
$ dfs_проверка_на_связность
# dfs # список_смежности
? Требуется небольшая модификация алгоритма обхода в глубину, в который будет возвращать количество посещенных вершин. Если возвращенное значение равно n - кол-ву вершин, то обход посетил все вершины графа, следовательно он связен. Иначе, какие-то вершины остались непосещенными.

? чтобы найти кол-во компонент связности, достаточно попытаться запустить серию обходов в глубину (серия обходов, это n вызовов dfs без обнуления used). Кол-во вызовов будет равно числу компонент связности.

*/

int dfs(int curr) {
	int amount(1);
	used[curr] = true;

	// обработать следующую вершину
	for (auto next : d[curr])
		if (!used[next])
			amount += dfs(next);

	return amount;
}

dfs(0) == n  // ! в этом случае граф связен