/*
* ------------ Сортировка вставками ------------
^ O(n^2)
$ сортировка_вставками
? Сортировка вставками – алгоритм сортировки, в котором элементы последовательности d рассматриваются по одному, и каждый новый рассматриваемый элемент - ключ key размещается в подходящее место среди ранее упорядоченных элементов. 

? На каждом шаге алгоритма выбирается один из элементов входных данных и помещается на нужную позицию в уже отсортированной последовательности до тех пор, пока набор входных данных не будет исчерпан. Элементы выбираются по порядку с 1 по n-1 (нумерация начинается с нуля, всего n элементов).

? Алгоритм работает так, что если переменная j внещнего цикла равна 5, то подпоследовательность d[0 ... 4] уже отсортирована. Пусть j = 5, значит key = d[5] (т.е. d[j]). Если возможно, то алгоритм "переместит" key ближе к началу последовательности так (или оставит на месте), что теперь уже d[0 ... 5] будет отсортирована. Каждый новый j-й элемент-ключ сравнивается со всеми предыдущими элементами уже отсортированной последовательности, пока не будет найден элемент d[i] > key или не будет достигнуто начало исходного массива d. На каждой итерации внутреннего цикла все элементы смещаются «вперед» на один индекс.
*/

vector <int> d(n);

// сортировка вставками
for (int j(1); j < n; j++) {
	int key = d[j]; // рассматриваемый элемент

	int i = j - 1;
	while (i >= 0 && d[i] > key) {
		d[i + 1] = d[i]; // смещение вперед
		i--;
	}

	d[i + 1] = key;
}
